Repository: zipf/perldoc-es
Catalog: memory/clean/omegat_clean_prj-level2.tmx
Source language: en_us
Languages: es

source: =item I<Learning Perl> (the "Llama Book")
es: =item I<Learning Perl> (el "Libro de la Llama")

source: =item I<Programming Perl> (the "Camel Book"):
es: =item I<Programming Perl> (el "Libro del Camello"):

source: =item I<The Perl Cookbook> (the "Ram Book"):
es: =item I<The Perl Cookbook> (el "Libro del Carnero"):

source: =item Internal file glob
es: =item Implementación interna de expansión de patrones de archivos

source: =item L<c2ph|c2ph> and L<pstruct|pstruct>
es: =item L<c2ph|c2ph> y L<pstruct|pstruct>

source: =item L<pod2html|pod2html> and L<pod2latex|pod2latex>
es: =item L<pod2html|pod2html> y L<pod2latex|pod2latex>

source: =item L<pod2man|pod2man> and L<pod2text|pod2text>
es: =item L<pod2man|pod2man> y L<pod2text|pod2text>

source: =item L<s2p|s2p> and L<psed>
es: =item L<s2p|s2p> y L<psed>

source: =item LIST
es: =item LISTA

source: =item Linux abstract Unix domain sockets
es: =item Sockets Linux abstractos en el dominio Unix

source: =item Long Doubles Still Don't Work In Solaris
es: =item Los valores Long Double siguen sin funcionar en Solaris

source: =item Look around
es: =item Examine código de otros programadores

source: =item Look-Around Assertions X<look-around assertion> X<lookaround assertion> X<look-around> X<lookaround>
es: =item Aserciones de inspección X<look-around assertion> X<lookaround assertion> X<look-around> X<lookaround> X<aserciones de inspección> X<aserción de inspección> X<inspección>

source: =item Lvalue subroutines
es: =item Subrutinas en el lado izquierdo de una asignación

source: =item Miscellaneous
es: =item Otros operadores

source: =item More complex regular expressions
es: =item Expresiones regulares más complejas

source: =item Numeric comparison
es: =item Comparación numérica

source: =item Operators which expect a string
es: =item Operadores que consumen una cadena

source: =item Operators which expect an integer
es: =item Operadores que consumen un entero

source: =item Other mathematical operators
es: =item Otros operadores matemáticos

source: =item Other regexp features
es: =item Otras características de las expresiones regulares

source: =item Parentheses for capturing
es: =item Paréntesis de captura

source: =item Pluggable keywords
es: =item Capacidad de agregar palabras clave

source: =item Scalars
es: =item Escalares

source: =item Simple matching
es: =item Detección de coincidencias sencilla

source: =item Simple substitution
es: =item Sustitución simple

source: =item Start with F<module-starter> or F<h2xs>
es: =item Para empezar, use F<module-starter> o F<h2xs>

source: =item String comparison
es: =item Comparación de cadenas

source: =item The <:pop> IO pseudolayer
es: =item La seudocapa de E/S <:pop>

source: =item The IO pseudolayer
es: =item la seudocapa de E/S

source: =item The C<\N> regex character class
es: =item La clase de caracteres C<\N> para expresiones regulares

source: =item The pseudo-hash data type
es: =item El tipo de datos seudohash

source: =item There is an C<installhtml> target in the Makefile.
es: =item Destino C<installhtml> en Makefile.

source: =item Unicode in Perl on EBCDIC
es: =item Unicode en Perl para EBCDIC

source: =item Unicode support
es: =item Compatibilidad con Unicode

source: =item Upload the tarball
es: =item Suba el paquete tar

source: =item Use L<Exporter|Exporter> - wisely!
es: =item Use L<Exporter|Exporter> con sensatez

source: =item Use L<plain old documentation|perlpod>
es: =item Use L<Documentación en texto simple (Plain Old Documentation)|perlpod>

source: =item Use L<strict|strict> and L<warnings|warnings>
es: =item Use L<strict|strict> y L<warnings|warnings>

source: =item VERSION($need) X<VERSION>
es: =item VERSION($necesaria) X<VERSION>

source: =item Verbs that take an argument
es: =item Verbos con un argumento

source: =item Verbs without an argument
es: =item Verbos sin argumento

source: =item Weak references
es: =item Referencias débiles

source: =item Write tests
es: =item Escriba pruebas

source: =item Write the README
es: =item Escriba el archivo README (LÉAME)

source: =item a, d, l and u X</a> X</d> X</l> X</u>
es: =item a, d, l, u X</a> X</d> X</l> X</u>

source: =item accessor methods
es: =item métodos de acceso

source: =item actual arguments
es: =item argumentos reales

source: =item address operator
es: =item operador de direccionamiento

source: =item algorithm
es: =item algoritmo

source: =item alternatives
es: =item alternativas

source: =item anonymous
es: =item anónimo

source: =item architecture
es: =item arquitectura

source: =item argument
es: =item argumento

source: =item arithmetical operator
es: =item operador aritmético

source: =item array context
es: =item contexto de array

source: =item assertion
es: =item aserción

source: =item assignment
es: =item asignación

source: =item assignment operator
es: =item operador de asignación

source: =item associative array
es: =item array asociativo

source: =item associativity
es: =item asociatividad

source: =item asynchronous
es: =item asincrónico

source: =item atom
es: =item átomo

source: =item atomic operation
es: =item operación atómica

source: =item attribute
es: =item atributo

source: =item autogeneration
es: =item autogeneración

source: =item autoincrement
es: =item autoincrementar

source: =item autoload
es: =item carga automática

source: =item autosplit
es: =item división automática

source: =item autovivification
es: =item autovivificación

source: =item backreference
es: =item retrorreferencia

source: =item backtracking
es: =item vuelta atrás

source: =item backward compatibility
es: =item compatibilidad con versiones anteriores

source: =item bareword
es: =item palabra suelta

source: =item base class
es: =item clase base

source: =item binary
es: =item binario

source: =item binary operator
es: =item operador binario

source: =item bind
es: =item enlazar

source: =item bit shift
es: =item desplazamiento de bits

source: =item bit string
es: =item cadena de bits

source: =item bless
es: =item bendecir

source: =item block
es: =item bloqueo-bloque

source: =item block buffering
es: =item almacenamiento en búfer de bloques

source: =item breakpoint
es: =item punto de interrupción

source: =item broadcast
es: =item difundir

source: =item bucket
es: =item casilla

source: =item buffer
es: =item búfer

source: =item built-in
es: =item elemento predefinido

source: =item bundle
es: =item conjunto

source: =item call by reference
es: =item llamada por referencia

source: =item call by value
es: =item llamada por valor

source: =item callback
es: =item devolución de llamada

source: =item can($method) X<can>
es: =item can($metodo) X<can>

source: =item canonical
es: =item canónico

source: =item capture buffer, capture group
es: =item búfer de captura, grupo de captura

source: =item capturing
es: =item capturar

source: =item character
es: =item carácter

source: =item character class
es: =item clase de caracteres

source: =item character property
es: =item propiedad de carácter

source: =item circumfix operator
es: =item operador envolvente

source: =item class
es: =item clase

source: =item class method
es: =item método de clase

source: =item client
es: =item cliente

source: =item cloister
es: =item claustro

source: =item closure
es: =item clausura

source: =item cluster
es: =item clúster

source: =item code generator
es: =item generador de código

source: =item code point
es: =item código de carácter

source: =item code subpattern
es: =item subpatrón de código

source: =item collating sequence
es: =item secuencia de intercalación

source: =item command
es: =item comando

source: =item command buffering
es: =item almacenamiento en búfer de comandos

source: =item command name
es: =item nombre de comando

source: =item command-line arguments
es: =item argumentos de línea de comandos

source: =item comment
es: =item comentario

source: =item compilation unit
es: =item unidad de compilación

source: =item compile phase
es: =item fase de compilación

source: =item compile time
es: =item tiempo de compilación

source: =item compiler
es: =item compilador

source: =item composer
es: =item sistema de composición

source: =item concatenation
es: =item concatenación

source: =item conditional
es: =item condicional

source: =item connection
es: =item conexión

source: =item construct
es: =item construcción-construir

source: =item context
es: =item contexto

source: =item continuation
es: =item continuación

source: =item core dump
es: =item volcado del núcleo

source: =item current package
es: =item paquete actual

source: =item current working directory
es: =item directorio de trabajo actual

source: =item currently selected output channel
es: =item canal de salida seleccionado actualmente

source: =item dangling statement
es: =item instrucción colgante

source: =item data structure
es: =item estructura de datos

source: =item data type
es: =item tipo de datos

source: =item datagram
es: =item datagrama

source: =item declaration
es: =item declaración

source: =item decrement
es: =item decrementar

source: =item default
es: =item valor predeterminado

source: =item defined
es: =item definido

source: =item delimiter
es: =item delimitador

source: =item deprecated modules and features
es: =item módulos y características obsoletos

source: =item dereference
es: =item desreferenciar

source: =item derived class
es: =item clase derivada

source: =item destroy
es: =item destruir

source: =item device
es: =item dispositivo

source: =item die accepts a reference
es: =item die acepta una referencia

source: =item directive
es: =item directiva

source: =item directory
es: =item directorio

source: =item directory handle
es: =item identificador de directorio

source: =item dispatch
es: =item distribuir

source: =item distribution
es: =item distribución

source: =item dynamic scoping
es: =item control de ámbito dinámico

source: =item eclectic
es: =item ecléctico

source: =item element
es: =item elemento

source: =item embedding
es: =item incrustar

source: =item empty list
es: =item lista vacía

source: =item empty subclass test
es: =item prueba de subclase vacía

source: =item encapsulation
es: =item encapsulación

source: =item environment
es: =item entorno

source: =item environment variable
es: =item variable de entorno

source: =item escape sequence
es: =item secuencia de escape

source: =item exception
es: =item excepción

source: =item exception handling
es: =item control de excepciones

source: =item executable file
es: =item archivo ejecutable

source: =item execute
es: =item ejecutar

source: =item execute bit
es: =item bit de ejecución

source: =item exit status
es: =item estado de salida

source: =item export
es: =item exportar

source: =item expression
es: =item expresión

source: =item extension
es: =item extensión

source: =item false
es: =item falso

source: =item fatal error
es: =item error irrecuperable

source: =item field
es: =item campo

source: =item file
es: =item archivo

source: =item file descriptor
es: =item descriptor de archivo

source: =item file test operator
es: =item operador de prueba de archivo

source: =item filehandle
es: =item identificador de archivo

source: =item filename
es: =item nombre de archivo

source: =item filesystem
es: =item sistema de archivos

source: =item filter
es: =item filtro

source: =item flag
es: =item marca

source: =item floating point
es: =item punto flotante

source: =item flush
es: =item vaciar

source: =item fork() emulation
es: =item Emulación de fork()

source: =item formal arguments
es: =item argumentos formales

source: =item format
es: =item formato

source: =item freely available
es: =item disponible gratuitamente

source: =item freely redistributable
es: =item redistribuible gratuitamente

source: =item function
es: =item función

source: =item funny character
es: =item carácter extraño

source: =item g and c X</g> X</c>
es: =item g, c X</g> X</c>

source: =item garbage collection
es: =item recolección de elementos no utilizados

source: =item global destruction
es: =item destrucción global

source: =item glue language
es: =item lenguaje pegamento

source: =item granularity
es: =item granularidad

source: =item greedy
es: =item avaricioso

source: =item group
es: =item grupo

source: =item handler
es: =item controlador

source: =item hard reference
es: =item referencia estricta

source: =item hash table
es: =item tabla hash

source: =item header file
es: =item archivo de encabezado

source: =item here document
es: =item documento incrustado

source: =item home directory
es: =item directorio principal

source: =item hubris
es: =item soberbia

source: =item i X</i> X<regex, case-insensitive> X<regexp, case-insensitive> X<regular expression, case-insensitive>
es: =item i X</i> X<regex, case-insensitive> X<regexp, case-insensitive> X<regular expression, case-insensitive> X<regex, no distinguir mayúsculas de minúsculas> X<regexp, no distinguir mayúsculas de minúsculas> X<expresión regular, no distinguir mayúsculas de minúsculas>

source: =item identifier
es: =item identificador

source: =item impatience
es: =item impaciencia

source: =item implementation
es: =item implementación

source: =item import
es: =item importar

source: =item increment
es: =item incrementar

source: =item indexing
es: =item indexar

source: =item indirect filehandle
es: =item identificador de archivo indirecto

source: =item indirect object
es: =item objeto indirecto

source: =item indirect object slot
es: =item vacante de objeto indirecto

source: =item indirection
es: =item direccionamiento indirecto

source: =item infix
es: =item infijo

source: =item inheritance
es: =item herencia

source: =item instance
es: =item instancia

source: =item instance variable
es: =item variable de instancia

source: =item integer
es: =item entero

source: =item interface
es: =item interfaz

source: =item internal API for C<%H>
es: =item API interna para C<%H>

source: =item internal functions with M flag
es: =item Funciones internas con la marca M

source: =item interpolation
es: =item interpolación

source: =item interpreter
es: =item intérprete

source: =item invocant
es: =item invocante

source: =item invocation
es: =item invocación

source: =item isa($class) X<isa>
es: =item isa($clase) X<isa>

source: =item iteration
es: =item iteración

source: =item iterator
es: =item iterador

source: =item key
es: =item clave

source: =item keyword
es: =item palabra clave

source: =item label
es: =item etiqueta

source: =item laziness
es: =item pereza

source: =item left shift
es: =item desplazamiento a la izquierda

source: =item leftmost longest
es: =item la más larga empezando por la izquierda

source: =item lex_start API
es: =item API lex_start

source: =item lexeme
es: =item lexema

source: =item lexer
es: =item separador de lexemas

source: =item lexical analysis
es: =item análisis léxico

source: =item lexical scoping
es: =item control de ámbito léxico

source: =item lexical variable
es: =item variable léxica

source: =item library
es: =item biblioteca

source: =item line
es: =item línea

source: =item line buffering
es: =item almacenamiento en búfer de líneas

source: =item line number
es: =item número de línea

source: =item link
es: =item vínculo/vincular

source: =item list
es: =item lista

source: =item list context
es: =item contexto de lista

source: =item list operator
es: =item operador de lista

source: =item list value
es: =item valor de lista

source: =item logical operator
es: =item operador lógico

source: =item lookahead
es: =item inspección hacia adelante

source: =item lookbehind
es: =item inspección hacia atrás

source: =item loop
es: =item bucle

source: =item loop control statement
es: =item instrucción de control de bucle

source: =item loop label
es: =item etiqueta de bucle

source: =item lvaluable
es: =item compatible con valores-izquierda

source: =item lvalue
es: =item valor-izquierda

source: =item lvalue modifier
es: =item modificador de valor-izquierda

source: =item m X</m> X<regex, multiline> X<regexp, multiline> X<regular expression, multiline>
es: =item m X</m> X<regex, multiline> X<regexp, multiline> X<regular expression, multiline> X<regex, multilínea> X<regexp, multilínea> X<expresión regular, multilínea>

source: =item magic
es: =item magia

source: =item magical increment
es: =item incremento mágico

source: =item magical variables
es: =item variables mágicas

source: =item manpage
es: =item página de manual

source: =item matching
es: =item detección

source: =item member data
es: =item datos de miembro

source: =item memory
es: =item memoria

source: =item metacharacter
es: =item metacarácter

source: =item metasymbol
es: =item metasímbolo

source: =item method
es: =item método

source: =item minimalism
es: =item minimalismo

source: =item mode
es: =item modo

source: =item modifier
es: =item modificador

source: =item module
es: =item módulo

source: =item modulus
es: =item módulo (teoría de números)

source: =item multidimensional array
es: =item array multidimensional

source: =item multiple inheritance
es: =item herencia múltiple

source: =item named pipe
es: =item tubería con nombre

source: =item namespace
es: =item espacio de nombres

source: =item network address
es: =item dirección de red

source: =item newline
es: =item carácter de nueva línea

source: =item null character
es: =item carácter nulo

source: =item null list
es: =item lista nula

source: =item null string
es: =item cadena nula

source: =item numeric context
es: =item contexto numérico

source: =item object
es: =item objeto

source: =item offset
es: =item desplazamiento

source: =item one-liner
es: =item script de una sola línea

source: =item open source software
es: =item software open source

source: =item operand
es: =item operando

source: =item operating system
es: =item sistema operativo

source: =item operator
es: =item operador

source: =item operator overloading
es: =item sobrecarga de operador

source: =item options
es: =item opciones

source: =item overloading
es: =item sobrecargar

source: =item overriding
es: =item sobrescribir

source: =item owner
es: =item propietario

source: =item p X</p> X<regex, preserve> X<regexp, preserve>
es: =item p X</p> X<regex, preserve> X<regexp, preserve> X<regex, conservar> X<regexp, conservar>

source: =item package
es: =item paquete

source: =item pad
es: =item bloc

source: =item parameter
es: =item parámetro

source: =item parent class
es: =item clase primaria

source: =item parse tree
es: =item árbol de análisis

source: =item parsing
es: =item analizar

source: =item patch
es: =item parchear/parche

source: =item pathname
es: =item ruta de acceso

source: =item pattern
es: =item patrón

source: =item pattern matching
es: =item detección de patrones

source: =item permission bits
es: =item bits de permiso

source: =item pipe
es: =item tubería

source: =item pipeline
es: =item canalización

source: =item platform
es: =item plataforma

source: =item pointer
es: =item puntero

source: =item polymorphism
es: =item polimorfismo

source: =item port
es: =item puerto-adaptar

source: =item postfix
es: =item postfijo

source: =item precedence
es: =item precedencia

source: =item prefix
es: =item prefijo

source: =item preprocessing
es: =item preprocesamiento

source: =item procedure
es: =item procedimiento

source: =item process
es: =item proceso

source: =item program generator
es: =item generador de programas

source: =item progressive matching
es: =item detección progresiva

source: =item property
es: =item propiedad

source: =item protocol
es: =item protocolo

source: =item prototype
es: =item prototipo

source: =item pseudofunction
es: =item seudofunción

source: =item pseudohash
es: =item seudohash

source: =item pseudoliteral
es: =item seudoliteral

source: =item public domain
es: =item dominio público

source: =item pumpkin
es: =item calabaza de parches

source: =item qualified
es: =item nombre completo

source: =item quantifier
es: =item cuantificador

source: =item readable
es: =item legible

source: =item reaping
es: =item siega

source: =item record
es: =item registro

source: =item recursion
es: =item recursividad

source: =item reference
es: =item referencia

source: =item referent
es: =item referente

source: =item regular expression
es: =item expresión regular

source: =item regular expression modifier
es: =item modificador de expresión regular

source: =item regular file
es: =item archivo normal

source: =item relational operator
es: =item operador relacional

source: =item reserved words
es: =item palabras reservadas

source: =item restricted hash
es: =item hash restringido

source: =item return value
es: =item valor devuelto

source: =item right shift
es: =item desplazamiento a la derecha

source: =item run phase
es: =item fase de ejecución

source: =item run time
es: =item tiempo de ejecución

source: =item run-time pattern
es: =item patrón de tiempo de ejecución

source: =item rvalue
es: =item valor-derecha

source: =item s X</s> X<regex, single-line> X<regexp, single-line> X<regular expression, single-line>
es: =item s X</s> X<regex, single-line> X<regexp, single-line> X<regular expression, single-line> X<regex, una línea> X<regexp, una línea> X<expresión regular, una línea>

source: =item scalar
es: =item escalar

source: =item scalar context
es: =item contexto escalar

source: =item scalar literal
es: =item literal escalar

source: =item scalar value
es: =item valor escalar

source: =item scalar variable
es: =item variable escalar

source: =item scope
es: =item ámbito

source: =item scratchpad
es: =item bloc de notas

source: =item semaphore
es: =item semáforo

source: =item separator
es: =item separador

source: =item serialization
es: =item serialización

source: =item server
es: =item servidor

source: =item service
es: =item servicio

source: =item shared memory
es: =item memoria compartida

source: =item side effects
es: =item efectos secundarios

source: =item signal
es: =item señal

source: =item signal handler
es: =item controlador de señales

source: =item single inheritance
es: =item herencia simple

source: =item slice
es: =item porción

source: =item slurp
es: =item succionar

source: =item soft reference
es: =item referencia no estricta

source: =item source filter
es: =item filtro de código fuente

source: =item stack
es: =item pila

source: =item standard
es: =item estándar

source: =item standard I/O
es: =item E/S estándar

source: =item standard error
es: =item error estándar

source: =item standard input
es: =item entrada estándar

source: =item standard output
es: =item salida estándar

source: =item stat structure
es: =item estructura stat

source: =item statement
es: =item instrucción

source: =item statement modifier
es: =item modificador de instrucción

source: =item static
es: =item estático

source: =item static method
es: =item método estático

source: =item static scoping
es: =item control de ámbito estático

source: =item static variable
es: =item variable estática

source: =item status
es: =item estado

source: =item stream
es: =item secuencia

source: =item string
es: =item cadena

source: =item string context
es: =item contexto de cadena

source: =item stringification
es: =item conversión en cadena

source: =item structure
es: =item estructura

source: =item subclass
es: =item subclase

source: =item subpattern
es: =item subpatrón

source: =item subroutine
es: =item subrutina

source: =item subscript
es: =item subíndice

source: =item substitution
es: =item sustitución

source: =item substring
es: =item subcadena

source: =item superclass
es: =item superclase

source: =item superuser
es: =item superusuario

source: =item switch
es: =item modificador/switch

source: =item switch cluster
es: =item grupo de modificadores

source: =item switch statement
es: =item instrucción switch
